-- Добавление значений:
-- INSERT INTO <название таблицы> (<список атрибутов>) VALUES
-- 	(<значения одного элемента через запятую>),
--  (<значения одного элемента через запятую>),
-- 	(<значения одного элемента через запятую>),
-- 	(<значения одного элемента через запятую>)
-- 	ON CONFLICT (<поле по которому может возникнуть конфликт>) 
-- 	DO UPDATE SET <какие поля заменить>;

-- Удаление значений:
-- DELETE FROM <название таблицы> WHERE <условие для выбора элемента>;

-- Изменение значений:
-- UPDATE <название таблицы> SET <что поменять> WHERE <у кого поменять>;


